<?php

namespace App\DataFixtures;

use Doctrine\Bundle\FixturesBundle\Fixture;
use Doctrine\Persistence\ObjectManager;
use App\Entity\Car;
use App\Entity\AddService;

class ServiceCarFixtures extends Fixture
{
    public function load(ObjectManager $manager): void
    {
        $serviceCarArray = [
            ['20524622129160532', 'Крепления детских сидений'],
            ['20524622129160532', 'Обогрев лобового стекла'],
            ['46998607911885010', 'Обогрев лобового стекла'],
            ['46998607911885010', 'Датчики парковки'],
            ['46998607911885010', 'Климат-контроль'],
            ['16623052788306146', 'Климат-контроль'],
            ['16623052788306146', 'Крепления детских сидений'],
            ['16623052788306146', 'Датчики парковки'],
            ['46972866401870844', 'Камера заднего вида'],
            ['46972866401870844', 'Обогрев лобового стекла'],
            ['46972866401870844', 'Подогрев сидений'],
            ['08217591273370506', 'Крепления детских сидений'],
            ['08217591273370506', 'Обогрев лобового стекла'],
            ['93876883250772029', 'Обогрев лобового стекла'],
            ['93876883250772029', 'Климат-контроль'],
            ['93876883250772029', 'Датчики парковки'],
            ['18845775208468184', 'Круиз-контроль'],
            ['18845775208468184', 'Климат-контроль'],
            ['18845775208468184', 'Камера заднего вида'],
            ['18845775208468184', 'Крепления детских сидений'],
            ['18845775208468184', 'Подогрев сидений'],
            ['11164288745437965', 'Климат-контроль'],
            ['11164288745437965', 'Крепления детских сидений'],
            ['19426885376871915', 'Камера заднего вида'],
            ['19426885376871915', 'Подогрев сидений'],
            ['19426885376871915', 'Климат-контроль'],
            ['19426885376871915', 'Круиз-контроль'],
            ['19426885376871915', 'Подогрев руля'],
            ['73329066390099932', 'Обогрев лобового стекла'],
            ['73329066390099932', 'Крепления детских сидений'],
            ['73329066390099932', 'Подогрев сидений'],
            ['16792670650274984', 'Подогрев руля'],
            ['16792670650274984', 'Подогрев сидений'],
            ['16792670650274984', 'Камера заднего вида'],
            ['16792670650274984', 'Круиз-контроль'],
            ['16792670650274984', 'Климат-контроль'],
            ['16792670650274984', 'Крепления детских сидений'],
            ['16792670650274984', 'Датчики парковки'],
            ['16792670650274984', 'Обогрев лобового стекла'],
            ['77222665727084389', 'Подогрев сидений'],
            ['77222665727084389', 'Камера заднего вида'],
            ['77222665727084389', 'Круиз-контроль'],
            ['77222665727084389', 'Климат-контроль'],
            ['77222665727084389', 'Подогрев руля'],
            ['63192064816322174', 'Подогрев сидений'],
            ['63192064816322174', 'Климат-контроль'],
            ['63192064816322174', 'Датчики парковки'],
            ['63192064816322174', 'Крепления детских сидений'],
            ['00461778306695595', 'Крепления детских сидений'],
            ['00461778306695595', 'Обогрев лобового стекла'],
            ['00461778306695595', 'Климат-контроль'],
            ['00461778306695595', 'Подогрев сидений'],
        ];

        foreach($serviceCarArray as $item){
            $car = $manager->getRepository(Car::class)->findBy(["car_vin" => $item[0]])[0];
            $addService = $manager->getRepository(AddService::class)->findBy(["srv_type" => $item[1]])[0];
            $car->addAddService($addService);
            $manager->persist($car);
        }

        $manager->flush();
    }
}
